[
  {
    "link": "https://leetcode.com",
    "description": "A Platform to learn and solve DSA problems",
    "keywords": "leetcode dsa learning"
  },
  {
    "link": "https://practice.geeksforgeeks.org/problem-of-the-day",
    "description": "Easier than Leetcode and a good way to start DSA",
    "keywords": "geeksforgeeks dsa learning"
  },
  {
    "link": "https://www.interviewbit.com/",
    "description": "Mainly focus on interview type of problems",
    "keywords": "interviewbit interview problem"
  },
  {
    "link": "https://takeuforward.org/strivers-a2z-dsa-course/strivers-a2z-dsa-course-sheet-2/",
    "description": "This course is made for people who want to learn DSA from A to Z for free in a well-organized and structured manner. The lecture quality is better than what you get in paid courses, the only thing we don’t provide is doubt support, but trust me our YouTube video comments resolve that as well, we have a wonderful community of 250K+ people who engage in all of the videos.",
    "keywords": "DSA"
  },
  {
    "link": "https://takeuforward.org/interviews/strivers-sde-sheet-top-coding-interview-problems/",
    "description": "SDE Sheet contains very handily crafted and picked top coding interview questions from different topics of Data Structures & Algorithms. These questions are one of the most asked coding interview questions in coding interviews of companies like Amazon, Microsoft, Media.net, Flipkart, etc, and cover almost all of the concepts related to Data Structure & Algorithms.",
    "keywords": "Interview"
  },
  {
    "link": "https://drive.google.com/file/d/1FMdN_OCfOI0iAeDlqswCiC2DZzD4nPsb/view",
    "description": "DSA-450 questions for cracking placements created by Love Babber",
    "keywords": "Love Babber DSA-450"
  },
  {
    "link": "https://youtube.com/playlist?list=PLUcsbZa0qzu3yNzzAxgvSgRobdUUJvz7p",
    "description": "DSA-1 playlist is created by youtuber Anuj Sharma. DSA playlist to learn from basics. Creator has cover various topics from easy level to hard level. The special part is coverage of various algorithms along with some questions. The playlist is sutaible for both c++ and java ",
    "keywords": "DSA One Anuj Bhaiyya"
  },
  {
    "link": "https://www.youtube.com/watch?v=rZ41y93P2Qo&list=PL9gnSGHSqcnr_DxHsP7AW9ftq0AtAyYqJ",
    "description": "DSA in java playlist is created by youtuber Kunal Kushwaha. creator of this playlist is very active open source contributor . one of the best DSA course available . ",
    "keywords": "DSA in Java"
  },
  {
    "link": "https://youtube.com/playlist?list=PLdo5W4Nhv31a8UcMN9-35ghv8qyFWD9_S",
    "description": "Jenny's C playlist is one of the best playlist available on the internet. The specialty is the simplicity in the course. She breaks down things so that they become very easy to learn",
    "keywords": "C Programming Lecture:Jenny's lectures CS/IT NET&JRF."
  },
  {
    "link": "https://www.youtube.com/watch?v=_uQrJ0TkZlc&list=PLTjRvDozrdlxj5wgH4qkvwSOdHLOCx10f",
    "description": "Programming with Mosh's python playlist for beginners available on Youtube. For absolute beginners, easy to understand, and codes to solve.",
    "keywords": "beginners course; Mosh python tutorial."
  },
  {
    "link": "https://www.techiedelight.com/",
    "description": "Just select the type and Try different approaches and learn from errors.",
    "keywords": "C++,Java,Python"
  }
]
